In [1]:
import pandas as pd
datos = pd.Series([10,20,30,40,50])

In [2]:
print (datos)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
datos_df = pd.DataFrame({
    "Nombre": ["Juan", "Ana", "Jose", "Arturo"],
    "Edad": [25, 30, 35, 40],
    "Pais": ["MX", "CO", "AR", "BR"]
})

print(datos_df)

   Nombre  Edad Pais
0    Juan    25   MX
1     Ana    30   CO
2    Jose    35   AR
3  Arturo    40   BR

In [4]:
print(datos_df["Nombre"][1])

Ana

In [5]:
print(datos_df["Nombre"])

0      Juan
1       Ana
2      Jose
3    Arturo
Name: Nombre, dtype: object

In [6]:
print(datos_df.loc[1])
print(datos_df.iloc[1])

Nombre    Ana
Edad       30
Pais       CO
Name: 1, dtype: object
Nombre    Ana
Edad       30
Pais       CO
Name: 1, dtype: object

In [7]:
# Seleccionar filas por etiqueta
print(datos_df.loc[0])  # Selecciona la primera fila
print(datos_df.loc[0:2])

Nombre    Juan
Edad        25
Pais        MX
Name: 0, dtype: object
  Nombre  Edad Pais
0   Juan    25   MX
1    Ana    30   CO
2   Jose    35   AR

In [8]:
# Seleccionar filas por etiqueta
print(datos_df.loc[0])  # Selecciona la primera fila
print(datos_df.loc[0:2])

Nombre    Juan
Edad        25
Pais        MX
Name: 0, dtype: object
  Nombre  Edad Pais
0   Juan    25   MX
1    Ana    30   CO
2   Jose    35   AR

In [9]:
print(datos_df.loc[0, 'Nombre'])  # Selecciona el valor en la primera fila y la columna 'Nombre'
print(datos_df.loc[:, ['Nombre', 'Pais']])  # Selecciona todas las filas pero solo las columnas 'Nombre' y 'Ciudad'

Juan
   Nombre Pais
0    Juan   MX
1     Ana   CO
2    Jose   AR
3  Arturo   BR

In [10]:
mydf = pd.DataFrame({
    'Name': ['Juan', 'Ana', 'Jose', 'Arturo', 'Maria'],
    'Age': [42,25,64,30,45],
    'Country': ['MX', 'CO', 'AR', 'BR', 'MX']
})

print(mydf['Age'])

0    42
1    25
2    64
3    30
4    45
Name: Age, dtype: int64

In [11]:
filter = mydf['Age'] > 30
print(filter)
print(mydf[filter])

0     True
1    False
2     True
3    False
4     True
Name: Age, dtype: bool
    Name  Age Country
0   Juan   42      MX
2   Jose   64      AR
4  Maria   45      MX

In [12]:
mydf['Salary'] = [1000, 2000, 1500, 1800, 2500]  # Nueva columna con sueldos
print(mydf)

     Name  Age Country  Salary
0    Juan   42      MX    1000
1     Ana   25      CO    2000
2    Jose   64      AR    1500
3  Arturo   30      BR    1800
4   Maria   45      MX    2500

In [13]:
mydf = mydf.drop(columns=['Salary'])
print(mydf)

     Name  Age Country
0    Juan   42      MX
1     Ana   25      CO
2    Jose   64      AR
3  Arturo   30      BR
4   Maria   45      MX

In [14]:
mydf = mydf.drop(index=[2])

In [15]:
print(mydf)

     Name  Age Country
0    Juan   42      MX
1     Ana   25      CO
3  Arturo   30      BR
4   Maria   45      MX

In [16]:
mydf = mydf.reset_index(drop=True)
print(mydf)

     Name  Age Country
0    Juan   42      MX
1     Ana   25      CO
2  Arturo   30      BR
3   Maria   45      MX

In [17]:
# Filtrar personas mayores de 30 años
mayores_30 = mydf[mydf['Age'] > 30]
print(mayores_30)

    Name  Age Country
0   Juan   42      MX
3  Maria   45      MX

In [18]:
over30_mex = mydf[mydf['Age'] > 30][mydf['Country'] == 'MX']    
print(over30_mex)

    Name  Age Country
0   Juan   42      MX
3  Maria   45      MX

/tmp/ipykernel_1658/2067405743.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  over30_mex = mydf[mydf['Age'] > 30][mydf['Country'] == 'MX']

In [19]:
my_filter = (mydf['Age'] > 30) & (mydf['Country'] == 'MX')
print(mydf)
print(mydf[my_filter])

     Name  Age Country
0    Juan   42      MX
1     Ana   25      CO
2  Arturo   30      BR
3   Maria   45      MX
    Name  Age Country
0   Juan   42      MX
3  Maria   45      MX

In [20]:
#Aumentar en 5 anos la edad de todos.
print(mydf['Age'])
mydf['Age'] = mydf['Age'] + 5
print(mydf['Age'])

0    42
1    25
2    30
3    45
Name: Age, dtype: int64
0    47
1    30
2    35
3    50
Name: Age, dtype: int64

In [21]:
print(mydf)

     Name  Age Country
0    Juan   47      MX
1     Ana   30      CO
2  Arturo   35      BR
3   Maria   50      MX

In [22]:
mydf['Salary'] = [50, 60, 90, 100]
print(mydf)

     Name  Age Country  Salary
0    Juan   47      MX      50
1     Ana   30      CO      60
2  Arturo   35      BR      90
3   Maria   50      MX     100

In [23]:
mydf['Bonus'] = mydf['Salary'] * 0.1
newrow = ['Jose', 50, 'MX', 100, 10]
mydf.loc[len(mydf)] = newrow
mydf.loc[mydf['Name'] == 'Jose' , 'Country'] = 'CL'
print(mydf)

     Name  Age Country  Salary  Bonus
0    Juan   47      MX      50    5.0
1     Ana   30      CO      60    6.0
2  Arturo   35      BR      90    9.0
3   Maria   50      MX     100   10.0
4    Jose   50      CL     100   10.0

In [24]:
mydf.describe()

             Age      Salary      Bonus
count   5.000000    5.000000   5.000000
mean   42.400000   80.000000   8.000000
std     9.289779   23.452079   2.345208
min    30.000000   50.000000   5.000000
25%    35.000000   60.000000   6.000000
50%    47.000000   90.000000   9.000000
75%    50.000000  100.000000  10.000000
max    50.000000  100.000000  10.000000

In [25]:
print(mydf['Age'].mean())
print(mydf['Salary'].median())
print(mydf['Bonus'].mode())
print(mydf['Age'].std())
print(mydf['Salary'].max())
print(mydf['Bonus'].min())

42.4
90.0
0    10.0
Name: Bonus, dtype: float64
9.289779329994872
100
5.0

In [26]:
# Crear un DataFrame de ejemplo
data = {
    'Edad': [23, 35, 30, 22, 40],
    'Salario': [50000, 60000, 70000, 80000, 90000],
    'Experiencia': [1, 10, 5, 2, 15]
}
df = pd.DataFrame(data)

# Calcular la matriz de correlación
correlacion = df.corr()

print(df)
print(correlacion)

   Edad  Salario  Experiencia
0    23    50000            1
1    35    60000           10
2    30    70000            5
3    22    80000            2
4    40    90000           15
                 Edad   Salario  Experiencia
Edad         1.000000  0.430458     0.979507
Salario      0.430458  1.000000     0.539949
Experiencia  0.979507  0.539949     1.000000

In [27]:
# La función corr() calcula la correlación entre las columnas numéricas del DataFrame.
# La correlación mide la relación entre dos variables, con valores entre -1 y 1.
# Un valor de 1 indica una correlación positiva perfecta, -1 una correlación negativa perfecta, y 0 ninguna correlación.
print(mydf['Country'].value_counts())  # Cuenta cuántas veces aparece cada país en la columna
print(mydf['Country'].nunique())  # Número de categorías únicas

Country
MX    2
CO    1
BR    1
CL    1
Name: count, dtype: int64
4